       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT1.
       AUTHOR. MARIO GARCIA.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE   ASSIGN TO 'EMPL.PROG1'
                   ORGANIZATION IS LINE SEQUENTIAL.
           SELECT PRNT-FILE    ASSIGN TO 'UR-S-PRNT'
                   ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD INPUT-FILE.
       01 INPUT-REC.
        88 EOF VALUE HIGH-VALUES.
        02 EMP-ID PIC 9(7).
        02 EMP-NAME.
         03 EMP-L-NAME PIC X(15).
         03 EMP-F-NAME PIC X(15).
        02 EMP-TYPE PIC 99.
        02 EMP-TITLE PIC X(17).
        02 EMP-SSN.
         03 EMP-SSN-1 PIC 9(3).
         03 EMP-SSN-2 PIC 9(2).
         03 EMP-SSN-3 PIC 9(4).
        02 FILLER PIC X(24) VALUE SPACES.
        02 EMP-DATE.
         03 EMP-DATE-M PIC 9(2).
         03 EMP-DATE-D PIC 9(2).
         03 EMP-DATE-Y PIC 9(4).
        02 FILLER PIC XX VALUE SPACES.
        02 EMP-RATE PIC 9(6).
        02 EMP-RATEV REDEFINES EMP-RATE PIC 9(4)V99.
        02 EMP-STATUS PIC X.
         88 SALARIED VALUE "S".
        02 EMP-DEDUCTIONS OCCURS 5 TIMES PIC 9(3)V99.

       FD PRNT-FILE.
       01 PRNT-REC PIC X(145).

       WORKING-STORAGE SECTION.
        01 CURRENT-DATE-DATA.
         02 CURRENT-DATE.
          03 CURRENT-YEAR PIC 9(4).
          03 CURRENT-MONTH PIC 9(2).
          03 CURRENT-DAY PIC 9(2).

       01 PRNT-HEADING-P1.
        02 FILLER PIC X VALUE SPACES.
        02 CUR-DATE.
         03 CUR-DATE-M PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 CUR-DATE-D PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 CUR-DATE-Y PIC 9(2).

        02 FILLER PIC X(40) VALUE SPACES.
        02 FILLER PIC X(21) VALUE "MASTERMIND COBOL, INC".
        02 FILLER PIC X(36) VALUE SPACES.
        02 FILLER PIC X(5) VALUE "PAGE ".
        02 PRN-PAGE-CNT PIC ZZ9.

       01 PRNT-HEADING-P3.
        02 FILLER PIC X(3) VALUE SPACES.
        02 FILLER PIC X(6) VALUE "EMP ID".
        02 FILLER PIC X(6) VALUE SPACES.
        02 FILLER PIC X(3) VALUE "SSN".
        02 FILLER PIC X(12) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "NAME".
        02 FILLER PIC X(34) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "TYPE".
        02 FILLER PIC X(2) VALUE SPACES.
        02 FILLER PIC X(5) VALUE "TITLE".
        02 FILLER PIC X(18) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "DATE".

       01 PRNT-HEADING-P4.
        02 FILLER PIC X(34) VALUE SPACES.
        02 FILLER PIC X(4) VALUE "LAST".
        02 FILLER PIC X(12) VALUE SPACES.
        02 FILLER PIC X(5) VALUE "FIRST".

       01 PRN-EMP-DATA-1.
        02 FILLER PIC X(3) VALUE SPACES.

        02 PRN-EMP-ID PIC 9(7).
        02 FILLER PIC X(4) VALUE SPACES.
        02 PRN-EMP-SSN.
         03 PRN-EMP-SSN-1 PIC 9(3).
         03 FILLER PIC X VALUE "-".
         03 PRN-EMP-SSN-2 PIC 9(2).
         03 FILLER PIC X VALUE "-".
         03 PRN-EMP-SSN-3 PIC 9(4).
        02 FILLER PIC X(5) VALUE SPACES.

        02 PRN-EMP-NAME.
         03 PRN-EMP-L-NAME PIC X(15).
         03 FILLER PIC X(4) VALUE SPACES.
         03 PRN-EMP-F-NAME PIC X(15).
        02 FILLER PIC X(5) VALUE SPACES.

        02 PRN-EMP-TYPE PIC 99.
        02 FILLER PIC X(4) VALUE SPACES.

        02 PRN-EMP-TITLE PIC X(17).
        02 FILLER PIC X(5) VALUE SPACES.

        02 PRN-EMP-DATE.
         03 PRN-EMP-DATE-M PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 PRN-EMP-DATE-D PIC 9(2).
         03 FILLER PIC X VALUE "/".
         03 PRN-EMP-DATE-Y PIC 9(4).
        02 FILLER PIC X(3) VALUE SPACES.

       01 PRN-EMP-DATA-2.
        02 FILLER PIC X(69) VALUE SPACES.
        02 FILLER PIC X(12) VALUE "DEDUCT:     ".
        02 PRN-DEDUCTION-1 PIC ZZ9.99.
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(8) VALUE "RATE:   ".
        02 PRN-EMP-RATE PIC Z,ZZ9.99.
        02 FILLER PIC X(4) VALUE SPACES.
        02 PRN-EMP-STATUS PIC X.

       01 PRN-EMP-DATA-DEDUCTIONS.
        02 FILLER PIC X(81) VALUE SPACES.
        02 PRN-DEDUCTIONS-2345 PIC ZZ9.99.

       01 PRN-EMP-DATA-DEDTOTAL.
        02 FILLER PIC X(69) VALUE SPACES.
        02 FILLER PIC X(9) VALUE "TOTAL:   ".
        02 PRN-DEDUCTIONS-TOTAL PIC $Z,ZZ9.99.

       01 PRNT-RECS-DATA.
        02 FILLER PIC X(32) VALUE "NUMBER OF EMPLOYEE RECORDS READ:".
        02 FILLER PIC X(14) VALUE SPACES.
        02 PRN-RECS-TOTAL PIC ZZ9.

       01 PRNT-HRY-EMP-DATA.
        02 FILLER PIC X(32) VALUE "NUMBER OF HOURLY EMPLOYEES:     ".
        02 FILLER PIC X(14) VALUE SPACES.
        02 PRN-HRY-EMP-NUM PIC ZZ9.
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(22) VALUE "AVERAGE HOURLY RATE:  ".
        02 FILLER PIC X(8) VALUE SPACES.
        02 PRN-AVG-HRY-RATE PIC $ZZZ.99.
        02 FILLER PIC X(8) VALUE SPACES.
        02 FILLER PIC X(14) VALUE "TOTAL DEDUCT:".
        02 PRN-ALL-DEDUCTIONS-TOTAL PIC $ZZ,ZZ9.99.

       01 PRNT-SRY-EMP-DATA.
        02 FILLER PIC X(32) VALUE "NUMBER OF SALARIED EMPLOYEES:   ".
        02 FILLER PIC X(14) VALUE SPACES.
        02 PRN-SRY-EMP-NUM PIC ZZ9.
        02 FILLER PIC X(4) VALUE SPACES.
        02 FILLER PIC X(27) VALUE "AVERAGE SALARIED RATE:     ".
        02 PRN-AVG-SRY-RATE PIC $ZZ,ZZ9.99.


       01 EMPLOYEES.
        02 RECS-TOTAL PIC 9(4) VALUE ZERO.
        02 HRY-EMP-NUM PIC 9(4) VALUE ZERO.
        02 SRY-EMP-NUM PIC 9(4) VALUE ZERO.

       01 RATES.
        02 TOTAL-HRY-RATE PIC 9(7) VALUE 0000000.
        02 AVG-HRY-RATE PIC 9(7).
        02 AVG-HRY-RATEV REDEFINES AVG-HRY-RATE PIC 9(5)V99.
        02 TOTAL-SRY-RATE PIC 9(7) VALUE 0000000.
        02 AVG-SRY-RATE PIC 9(7).
        02 AVG-SRY-RATEV REDEFINES AVG-SRY-RATE PIC 9(5)V99.

       01 DEDUCTIONS.
        02 DEDUCTIONS-TOTAL PIC 9(6) VALUE 000000.
        02 DEDUCTIONS-TOTALV REDEFINES DEDUCTIONS-TOTAL PIC 9(4)V99.
        02 DEDUCTION-1 PIC 9(5).
        02 ALL-DEDUCTIONS-TOTAL PIC 9(7) VALUE 0000000.
        02 ALL-DEDUCT-TOTALV REDEFINES ALL-DEDUCTIONS-TOTAL PIC 9(5)V99.
       01 MISC.
        02 i PIC 9 VALUE 0.
        02 LINE-CNT PIC 999 VALUE ZERO.
        02 PAGE-CNT PIC 9 VALUE ZERO.

       PROCEDURE DIVISION.
       MAIN.
       OPEN INPUT INPUT-FILE
       OUTPUT PRNT-FILE.

       READ INPUT-FILE INTO INPUT-REC
               AT END SET EOF TO TRUE
       END-READ

       PERFORM UNTIL EOF
           IF FUNCTION MOD (LINE-CNT, 25) = 0
            ADD 1 TO PAGE-CNT
            PERFORM PRINT-ALL-HEADINGS
           END-IF
          ADD 1 TO RECS-TOTAL
           IF SALARIED ADD 1 TO SRY-EMP-NUM
               ADD EMP-RATE TO TOTAL-SRY-RATE
           ELSE ADD 1 TO HRY-EMP-NUM
               ADD EMP-RATE TO TOTAL-HRY-RATE
           END-IF

          PERFORM PRINT-RESULTS
          READ INPUT-FILE INTO INPUT-REC
               AT END SET EOF TO TRUE
          END-READ
       END-PERFORM

       PERFORM PRINT-SUMMARY
       CLOSE INPUT-FILE, PRNT-FILE
       STOP RUN.

       PRINT-ALL-HEADINGS.
          PERFORM PRINT-HEADING-P1.
          PERFORM PRINT-HEADING-P3.
          PERFORM PRINT-HEADING-P4.
          ADD 4 TO LINE-CNT.


       PRINT-HEADING-P1.
           MOVE SPACES TO PRNT-REC.
           WRITE PRNT-REC AFTER ADVANCING 4 LINES.
           MOVE FUNCTION CURRENT-DATE TO CURRENT-DATE-DATA.
           MOVE CURRENT-DAY TO CUR-DATE-D.
           MOVE CURRENT-MONTH TO CUR-DATE-M.
           MOVE CURRENT-YEAR TO CUR-DATE-Y.
           MOVE PAGE-CNT TO PRN-PAGE-CNT.
           WRITE PRNT-REC FROM PRNT-HEADING-P1 AFTER ADVANCING 1 LINE.
       PRINT-HEADING-P3.
           WRITE PRNT-REC FROM PRNT-HEADING-P3 AFTER ADVANCING 1 LINE.
       PRINT-HEADING-P4.
           WRITE PRNT-REC FROM PRNT-HEADING-P4 AFTER ADVANCING 1 LINE.
           MOVE SPACES TO PRNT-REC.
          WRITE PRNT-REC AFTER ADVANCING 1 LINE.
       PRINT-RESULTS.
           MOVE EMP-ID TO PRN-EMP-ID
          MOVE EMP-SSN-1 TO PRN-EMP-SSN-1
          MOVE EMP-SSN-2 TO PRN-EMP-SSN-2
          MOVE EMP-SSN-3 TO PRN-EMP-SSN-3
          MOVE EMP-L-NAME TO PRN-EMP-L-NAME
          MOVE EMP-F-NAME TO PRN-EMP-F-NAME
          MOVE EMP-TITLE TO PRN-EMP-TITLE
          MOVE EMP-TYPE TO PRN-EMP-TYPE
          MOVE EMP-DATE-M TO PRN-EMP-DATE-M
          MOVE EMP-DATE-D TO PRN-EMP-DATE-D
          MOVE EMP-DATE-Y TO PRN-EMP-DATE-Y
          MOVE EMP-RATEV TO PRN-EMP-RATE
          MOVE EMP-STATUS TO PRN-EMP-STATUS
          WRITE PRNT-REC FROM PRN-EMP-DATA-1
          AFTER ADVANCING 1 LINE

          PERFORM VARYING i FROM 1 BY 1 UNTIL i GREATER THAN 5
                  IF i = 1
                        MOVE EMP-DEDUCTIONS(i) TO DEDUCTION-1
                        MOVE DEDUCTION-1 TO PRN-DEDUCTION-1
                        WRITE PRNT-REC FROM PRN-EMP-DATA-2
                        AFTER ADVANCING 1 LINE
                 ELSE
                         MOVE EMP-DEDUCTIONS(i) TO PRN-DEDUCTIONS-2345
                         WRITE PRNT-REC FROM PRN-EMP-DATA-DEDUCTIONS
                         AFTER ADVANCING 1 LINE
                 END-IF

                 ADD EMP-DEDUCTIONS(i) TO DEDUCTIONS-TOTAL
                 ADD EMP-DEDUCTIONS(i) TO ALL-DEDUCTIONS-TOTAL
                 MOVE DEDUCTIONS-TOTAL TO PRN-DEDUCTIONS-TOTAL

           END-PERFORM
           MOVE ZEROES TO DEDUCTIONS-TOTAL

          WRITE PRNT-REC FROM PRN-EMP-DATA-DEDTOTAL
          AFTER ADVANCING 1 LINE
          MOVE SPACES TO PRNT-REC
          WRITE PRNT-REC AFTER ADVANCING 1 LINE
          ADD 7 TO LINE-CNT.

       PRINT-SUMMARY.
           ADD 1 TO PAGE-CNT
           PERFORM PRINT-HEADING-P1.
          MOVE RECS-TOTAL TO PRN-RECS-TOTAL
          WRITE PRNT-REC FROM PRNT-RECS-DATA
           AFTER ADVANCING 2 LINES.
           MOVE HRY-EMP-NUM TO PRN-HRY-EMP-NUM

           DIVIDE TOTAL-HRY-RATE BY HRY-EMP-NUM GIVING AVG-HRY-RATE
           ROUNDED
           MOVE AVG-HRY-RATEV TO PRN-AVG-HRY-RATE
           MOVE ALL-DEDUCT-TOTALV TO PRN-ALL-DEDUCTIONS-TOTAL
           WRITE PRNT-REC FROM PRNT-HRY-EMP-DATA
           AFTER ADVANCING 1 LINES.
           MOVE SRY-EMP-NUM TO PRN-SRY-EMP-NUM

           DIVIDE TOTAL-SRY-RATE BY SRY-EMP-NUM GIVING AVG-SRY-RATE
           ROUNDED
           MOVE AVG-SRY-RATEV TO PRN-AVG-SRY-RATE
           WRITE PRNT-REC FROM PRNT-SRY-EMP-DATA
           AFTER ADVANCING 1 LINES.
